<a href="https://colab.research.google.com/github/aniruddhamodak/Students-Grade-Python-Assignment-3/blob/master/Python_Assignment_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

import numpy as np

In [0]:
studentlist = pd.read_csv("/content/drive/My Drive/Python Assignment 3/Untitled folder/studentlist.csv")
qz1 = pd.read_csv('/content/drive/My Drive/Python Assignment 3/Untitled folder/quiz1.csv')
qz2 = pd.read_csv("/content/drive/My Drive/Python Assignment 3/Untitled folder/quiz2.csv")

In [0]:
print(studentlist.head())

   enrollmentnumber          admn     studentname  studentEmail
0        1613101016  16SCSE101757   AAYUSH  TYAGI           NaN
1        1613101026  16SCSE101415        ABHISHEK           NaN
2        1613101051  16SCSE101222    ADITI  SINGH           NaN
3        1613101054  16SCSE101220  ADITYA  MANKAR           NaN
4        1613101079  16SCSE101085   AKASH  KANSAL           NaN

## Student Email section is contain NaN value.So dropping that coloumn & admn coloumn.

In [0]:
studentlist = studentlist.drop(columns=['admn','studentEmail'])

In [0]:
studentlist

      enrollmentnumber           studentname
0           1613101016         AAYUSH  TYAGI
1           1613101026              ABHISHEK
2           1613101051          ADITI  SINGH
3           1613101054        ADITYA  MANKAR
4           1613101079         AKASH  KANSAL
...                ...                   ...
1012        1613106007         PARTH  SHUKLA
1013        1613106009         ROBIN  SHARMA
1014        1613106010  SHITIKANT  PRIYANSHU
1015        1613106011      SHREYANSH  KUMAR
1016        1613106013     SWARNIM  TRIPATHI

[1017 rows x 2 columns]

In [0]:
qz1.head()

      Surname        Firstname  ...        Time taken Grade/10.00
0  16BTCSES11  SIDDHANT  GUPTA  ...     14 mins 1 sec           4
1  16BTCSES11    ARPIT  SHARMA  ...    14 mins 5 secs           5
2  16BTCSES11    VISHAL  SINGH  ...            6 days           7
3  16BTCSES11     AKASH  YADAV  ...    6 days 2 hours           9
4  16BTCSES11   MANISH  SAHANI  ...  13 hours 11 mins           7

[5 rows x 11 columns]

### **Dropping unwanted columns and NaN valuse**

In [0]:
qz1 = qz1.drop(columns=['Surname','ID number','Institution','Department','Email address','Started on','Completed','State'])

In [0]:
qz1.head()

         Firstname        Time taken Grade/10.00
0  SIDDHANT  GUPTA     14 mins 1 sec           4
1    ARPIT  SHARMA    14 mins 5 secs           5
2    VISHAL  SINGH            6 days           7
3     AKASH  YADAV    6 days 2 hours           9
4   MANISH  SAHANI  13 hours 11 mins           7

In [0]:
qz2 = qz2.drop(columns=['Surname','ID number','Institution','Department','Email address','Started on','Completed','State'])

In [0]:
qz2.head()

           Firstname       Time taken Grade/10.00
0  VEER SINGH GURJAR    8 mins 8 secs           4
1     PRANSHU  VERMA  14 mins 41 secs          10
2       EJAZ  BAKHSH  15 mins 18 secs           4
3         MOHD  FAIZ   19 mins 2 secs          10
4       ANISH  SINGH     9 mins 1 sec          10

In [0]:
studentgrade1 = pd.merge(studentlist,qz1,left_on='studentname',right_on='Firstname')

In [0]:
studentgrade1

     enrollmentnumber            studentname  ...       Time taken Grade/10.00
0          1613101016          AAYUSH  TYAGI  ...   7 mins 14 secs           5
1          1613101026               ABHISHEK  ...  15 mins 41 secs           7
2          1613101051           ADITI  SINGH  ...  16 mins 52 secs           5
3          1613101054         ADITYA  MANKAR  ...  16 mins 59 secs           7
4          1613101106           Aman  Pandey  ...   6 mins 29 secs           5
..                ...                    ...  ...              ...         ...
652        1613113014           VINOD  KUMAR  ...  21 mins 55 secs           4
653        1613106002           Akash  Kumar  ...  27 mins 58 secs           7
654        1613106003  AVINASH KUMAR JAISWAL  ...   5 mins 43 secs          10
655        1613106005           MAYANK  JAIN  ...  33 mins 57 secs           8
656        1613106009          ROBIN  SHARMA  ...  39 mins 44 secs           7

[657 rows x 5 columns]

In [0]:
studentgrade1.drop(columns= 'Firstname', inplace=True)

In [0]:
studentgrade1

     enrollmentnumber            studentname       Time taken Grade/10.00
0          1613101016          AAYUSH  TYAGI   7 mins 14 secs           5
1          1613101026               ABHISHEK  15 mins 41 secs           7
2          1613101051           ADITI  SINGH  16 mins 52 secs           5
3          1613101054         ADITYA  MANKAR  16 mins 59 secs           7
4          1613101106           Aman  Pandey   6 mins 29 secs           5
..                ...                    ...              ...         ...
652        1613113014           VINOD  KUMAR  21 mins 55 secs           4
653        1613106002           Akash  Kumar  27 mins 58 secs           7
654        1613106003  AVINASH KUMAR JAISWAL   5 mins 43 secs          10
655        1613106005           MAYANK  JAIN  33 mins 57 secs           8
656        1613106009          ROBIN  SHARMA  39 mins 44 secs           7

[657 rows x 4 columns]

In [0]:
studentgrade2 = pd.merge(studentlist,qz2,left_on='studentname',right_on='Firstname')

In [0]:
studentgrade2

     enrollmentnumber        studentname  ...       Time taken Grade/10.00
0          1613101016      AAYUSH  TYAGI  ...   3 mins 11 secs          10
1          1613101026           ABHISHEK  ...  17 mins 58 secs          10
2          1613101051       ADITI  SINGH  ...  13 mins 35 secs           9
3          1613101054     ADITYA  MANKAR  ...  12 mins 18 secs           8
4          1613101106       Aman  Pandey  ...   2 mins 35 secs          10
..                ...                ...  ...              ...         ...
671        1613106005       MAYANK  JAIN  ...   8 mins 49 secs          10
672        1613106007      PARTH  SHUKLA  ...   8 mins 47 secs           2
673        1613106009      ROBIN  SHARMA  ...  10 mins 52 secs           7
674        1613106011   SHREYANSH  KUMAR  ...   5 mins 44 secs           6
675        1613106013  SWARNIM  TRIPATHI  ...   10 mins 2 secs           8

[676 rows x 5 columns]

In [0]:
studentgrade2.drop(columns= 'Firstname', inplace=True)
studentgrade2

     enrollmentnumber        studentname       Time taken Grade/10.00
0          1613101016      AAYUSH  TYAGI   3 mins 11 secs          10
1          1613101026           ABHISHEK  17 mins 58 secs          10
2          1613101051       ADITI  SINGH  13 mins 35 secs           9
3          1613101054     ADITYA  MANKAR  12 mins 18 secs           8
4          1613101106       Aman  Pandey   2 mins 35 secs          10
..                ...                ...              ...         ...
671        1613106005       MAYANK  JAIN   8 mins 49 secs          10
672        1613106007      PARTH  SHUKLA   8 mins 47 secs           2
673        1613106009      ROBIN  SHARMA  10 mins 52 secs           7
674        1613106011   SHREYANSH  KUMAR   5 mins 44 secs           6
675        1613106013  SWARNIM  TRIPATHI   10 mins 2 secs           8

[676 rows x 4 columns]

In [0]:
studentgrade1.drop(columns= 'Time taken', inplace=True)
studentgrade2.drop(columns= 'Time taken', inplace=True)

In [0]:
print(studentgrade1.head())
print('______________________________________________________________________')
print(studentgrade2.head())

   enrollmentnumber     studentname Grade/10.00
0        1613101016   AAYUSH  TYAGI           5
1        1613101026        ABHISHEK           7
2        1613101051    ADITI  SINGH           5
3        1613101054  ADITYA  MANKAR           7
4        1613101106    Aman  Pandey           5
______________________________________________________________________
   enrollmentnumber     studentname Grade/10.00
0        1613101016   AAYUSH  TYAGI          10
1        1613101026        ABHISHEK          10
2        1613101051    ADITI  SINGH           9
3        1613101054  ADITYA  MANKAR           8
4        1613101106    Aman  Pandey          10

In [0]:
studentgrade1.rename(columns={'Grade/10.00' : 'Quiz1 Grade'}, inplace=True)
studentgrade2.rename(columns={'Grade/10.00' : 'Quiz2 Grade'}, inplace=True)

In [0]:
print(studentgrade1.head())
print("                                                   ")
print("                                                   ")
print('--------------------------------------------------------------------')
print("                                                   ")
print("                                                   ")
print(studentgrade2.head())

   enrollmentnumber     studentname Quiz1 Grade
0        1613101016   AAYUSH  TYAGI           5
1        1613101026        ABHISHEK           7
2        1613101051    ADITI  SINGH           5
3        1613101054  ADITYA  MANKAR           7
4        1613101106    Aman  Pandey           5


--------------------------------------------------------------------


   enrollmentnumber     studentname Quiz2 Grade
0        1613101016   AAYUSH  TYAGI          10
1        1613101026        ABHISHEK          10
2        1613101051    ADITI  SINGH           9
3        1613101054  ADITYA  MANKAR           8
4        1613101106    Aman  Pandey          10

In [0]:
studentgrade1

     enrollmentnumber            studentname Quiz1 Grade
0          1613101016          AAYUSH  TYAGI           5
1          1613101026               ABHISHEK           7
2          1613101051           ADITI  SINGH           5
3          1613101054         ADITYA  MANKAR           7
4          1613101106           Aman  Pandey           5
..                ...                    ...         ...
652        1613113014           VINOD  KUMAR           4
653        1613106002           Akash  Kumar           7
654        1613106003  AVINASH KUMAR JAISWAL          10
655        1613106005           MAYANK  JAIN           8
656        1613106009          ROBIN  SHARMA           7

[657 rows x 3 columns]

In [0]:
studentgrade = pd.merge(studentgrade1, studentgrade2, on='studentname')

In [0]:
studentgrade

     enrollmentnumber_x            studentname  ... enrollmentnumber_y  Quiz2 Grade
0            1613101016          AAYUSH  TYAGI  ...         1613101016           10
1            1613101026               ABHISHEK  ...         1613101026           10
2            1613101051           ADITI  SINGH  ...         1613101051            9
3            1613101054         ADITYA  MANKAR  ...         1613101054            8
4            1613101106           Aman  Pandey  ...         1613101106           10
..                  ...                    ...  ...                ...          ...
506          1613113014           VINOD  KUMAR  ...         1613113014            7
507          1613106002           Akash  Kumar  ...         1613106002           10
508          1613106003  AVINASH KUMAR JAISWAL  ...         1613106003            8
509          1613106005           MAYANK  JAIN  ...         1613106005           10
510          1613106009          ROBIN  SHARMA  ...         1613106009            7

[511 rows x 5 columns]

In [0]:
studentgrade.drop(columns='enrollmentnumber_y')

     enrollmentnumber_x            studentname Quiz1 Grade Quiz2 Grade
0            1613101016          AAYUSH  TYAGI           5          10
1            1613101026               ABHISHEK           7          10
2            1613101051           ADITI  SINGH           5           9
3            1613101054         ADITYA  MANKAR           7           8
4            1613101106           Aman  Pandey           5          10
..                  ...                    ...         ...         ...
506          1613113014           VINOD  KUMAR           4           7
507          1613106002           Akash  Kumar           7          10
508          1613106003  AVINASH KUMAR JAISWAL          10           8
509          1613106005           MAYANK  JAIN           8          10
510          1613106009          ROBIN  SHARMA           7           7

[511 rows x 4 columns]

In [0]:
studentgrade['Quiz1 Grade']= studentgrade['Quiz1 Grade'].apply(pd.to_numeric,errors="coerce")
studentgrade['Quiz2 Grade']= studentgrade['Quiz2 Grade'].apply(pd.to_numeric,errors="coerce")

In [0]:
studentgrade = studentgrade.drop(columns='enrollmentnumber_y')

In [0]:
studentgrade = studentgrade.drop(columns='enrollmentnumber_x')

In [0]:
Grade_Qz1 = []
for grade in studentgrade['Quiz1 Grade']:
        if grade > 9:    Grade_Qz1.append('A')
        elif grade > 8:  Grade_Qz1.append('A-')
        elif grade > 7:  Grade_Qz1.append('B')
        elif grade > 6:  Grade_Qz1.append('B-')
        elif grade > 5:  Grade_Qz1.append('C')
        elif grade > 4:  Grade_Qz1.append('C-')
        elif grade > 3:  Grade_Qz1.append('D')
        elif grade > 2:  Grade_Qz1.append('D-')
        else:           Grade_Qz1.append('Failed')
studentgrade['Grade Qz1'] = Grade_Qz1
print(studentgrade)

               studentname  Quiz1 Grade  Quiz2 Grade Grade Qz1
0            AAYUSH  TYAGI          5.0         10.0        C-
1                 ABHISHEK          7.0         10.0        B-
2             ADITI  SINGH          5.0          9.0        C-
3           ADITYA  MANKAR          7.0          8.0        B-
4             Aman  Pandey          5.0         10.0        C-
..                     ...          ...          ...       ...
506           VINOD  KUMAR          4.0          7.0         D
507           Akash  Kumar          7.0         10.0        B-
508  AVINASH KUMAR JAISWAL         10.0          8.0         A
509           MAYANK  JAIN          8.0         10.0         B
510          ROBIN  SHARMA          7.0          7.0        B-

[511 rows x 4 columns]

In [0]:
Grade_Qz2 = []
for grade in studentgrade['Quiz2 Grade']:
        if grade > 9:    Grade_Qz2.append('A')
        elif grade > 8:  Grade_Qz2.append('A-')
        elif grade > 7:  Grade_Qz2.append('B')
        elif grade > 6:  Grade_Qz2.append('B-')
        elif grade > 5:  Grade_Qz2.append('C')
        elif grade > 4:  Grade_Qz2.append('C-')
        elif grade > 3:  Grade_Qz2.append('D')
        elif grade > 2:  Grade_Qz2.append('D-')
        else:           Grade_Qz2.append('Failed')
studentgrade['Grade Qz2'] = Grade_Qz2
print(studentgrade)

               studentname  Quiz1 Grade  Quiz2 Grade Grade Qz1 Grade Qz2
0            AAYUSH  TYAGI          5.0         10.0        C-         A
1                 ABHISHEK          7.0         10.0        B-         A
2             ADITI  SINGH          5.0          9.0        C-        A-
3           ADITYA  MANKAR          7.0          8.0        B-         B
4             Aman  Pandey          5.0         10.0        C-         A
..                     ...          ...          ...       ...       ...
506           VINOD  KUMAR          4.0          7.0         D        B-
507           Akash  Kumar          7.0         10.0        B-         A
508  AVINASH KUMAR JAISWAL         10.0          8.0         A         B
509           MAYANK  JAIN          8.0         10.0         B         A
510          ROBIN  SHARMA          7.0          7.0        B-        B-

[511 rows x 5 columns]

In [0]:
studentgrade.head()

      studentname  Quiz1 Grade  Quiz2 Grade Grade Qz1 Grade Qz2
0   AAYUSH  TYAGI          5.0         10.0        C-         A
1        ABHISHEK          7.0         10.0        B-         A
2    ADITI  SINGH          5.0          9.0        C-        A-
3  ADITYA  MANKAR          7.0          8.0        B-         B
4    Aman  Pandey          5.0         10.0        C-         A